; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	thermograph0 - mode
	spectrograph1 - mode
	image2 - mode
	spectrograph3 - mode
	image5 - mode
	thermograph4 - mode
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation6 - direction
	Star2 - direction
	Star7 - direction
	Star10 - direction
	Star4 - direction
	GroundStation9 - direction
	Star8 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 Star2)
	(supports instrument1 image5)
	(supports instrument1 thermograph0)
	(supports instrument1 image2)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star10)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 Star4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
)
(:goal (and
	(pointing satellite0 Phenomenon14)
	(have_image Phenomenon12 spectrograph3)
	(have_image Planet13 spectrograph1)
	(have_image Phenomenon14 spectrograph3)
	(have_image Phenomenon14 spectrograph1)
	(have_image Star15 thermograph4)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (turn_to satellite1 star15 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star15)
   goals met: 0 of 6
4. (turn_to satellite0 phenomenon12 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon12)
   goals met: 0 of 6
5. (turn_to satellite1 star8 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star8)
   goals met: 0 of 6
6. (calibrate satellite1 instrument2 star8)
   added: (calibrated instrument2)
   goals met: 0 of 6
7. (turn_to satellite1 star15 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star15)
   goals met: 0 of 6
8. (take_image satellite1 star15 instrument2 thermograph4)
   added: (have_image star15 thermograph4)
   goals met: 1 of 6
9. (turn_to satellite0 star7 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star7)
   goals met: 1 of 6
10. (calibrate satellite0 instrument0 star7)
   added: (calibrated instrument0)
   goals met: 1 of 6
11. (turn_to satellite0 phenomenon12 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon12)
   goals met: 1 of 6
12. (take_image satellite0 phenomenon12 instrument0 spectrograph3)
   added: (have_image phenomenon12 spectrograph3)
   goals met: 2 of 6
13. (turn_to satellite0 phenomenon14 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon14)
   goals met: 3 of 6
14. (take_image satellite0 phenomenon14 instrument0 spectrograph1)
   added: (have_image phenomenon14 spectrograph1)
   goals met: 4 of 6
15. (take_image satellite0 phenomenon14 instrument0 spectrograph3)
   added: (have_image phenomenon14 spectrograph3)
   goals met: 5 of 6
16. (turn_to satellite0 planet13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet13)
   goals met: 4 of 6
17. (take_image satellite0 planet13 instrument0 spectrograph1)
   added: (have_image planet13 spectrograph1)
   goals met: 5 of 6
18. (turn_to satellite0 phenomenon14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon14)
   goals met: 6 of 6
